src/test/resources/requests/Get_Ticket.xml

<?xml version='1.0' encoding='utf-8'?>
<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
    <soap-env:Header>
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
            <wsse:UsernameToken>
                <wsse:Username>expresst</wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">etkt0813</wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
    </soap-env:Header>
    <soap-env:Body>
        <ns0:getTicketRequest xmlns:ns0="http://aots.att.com/ticket/v1">
            <ns1:WSHeader xmlns:ns1="http://cio.att.com/commonheader/v3">
                <ns1:WSContext>
                    <ns1:FromAppId>ETT_aotsGetTicket</ns1:FromAppId>
                    <ns1:SourceIPAddress>express-ticketing-84d5594bc7-wvckz</ns1:SourceIPAddress>
                </ns1:WSContext>
            </ns1:WSHeader>
            <ns0:getTicketInput>
                <ns2:FieldsList xmlns:ns2="http://tktsvc.aots.att.com/ticket">
                    <ns2:String>NBIPVPNIndicator</ns2:String>
                    <ns2:String>ReptSvcLineDescText</ns2:String>
                    <ns2:String>FunctionalArea</ns2:String>
                    <ns2:String>TicketOpened</ns2:String>
                    <ns2:String>TicketState</ns2:String>
                    <ns2:String>TicketRole</ns2:String>
                    <ns2:String>LocationStateProvince</ns2:String>
                    <ns2:String>AssetLocationState</ns2:String>
                    <ns2:String>BvoipStateProvince</ns2:String>
                    <ns2:String>AssetLocationCountry</ns2:String>
                    <ns2:String>BvoipCountryCode</ns2:String>
                    <ns2:String>ISOCountryCode</ns2:String>
                    <ns2:String>LocationCountry</ns2:String>
                    <ns2:String>TelephoneCountryCode</ns2:String>
                    <ns2:String>ProviderTicketNum</ns2:String>
                    <ns2:String>ResolutionSetDescription</ns2:String>
                    <ns2:String>CurrentStatus</ns2:String>
                    <ns2:String>OrgGroup</ns2:String>
                    <ns2:String>MCN</ns2:String>
                    <ns2:String>AssetType</ns2:String>
                    <ns2:String>ActiveOrg</ns2:String>
                    <ns2:String>ClientTicketNum</ns2:String>
                    <ns2:String>TestSummary</ns2:String>
                    <ns2:String>DispatchAuthorized</ns2:String>
                    <ns2:String>AuthTest</ns2:String>
                </ns2:FieldsList>
                <ns3:TicketNum xmlns:ns3="http://tktsvc.aots.att.com/ticket">CS0012210</ns3:TicketNum>
                <ns4:TicketClass xmlns:ns4="http://tktsvc.aots.att.com/ticket">TT</ns4:TicketClass>
                <ns5:LogQualifier xmlns:ns5="http://tktsvc.aots.att.com/ticket">3</ns5:LogQualifier>
                <ns6:GetLocationInfo xmlns:ns6="http://tktsvc.aots.att.com/ticket">true</ns6:GetLocationInfo>
                <ns7:GetPVCDetailsInfo xmlns:ns7="http://tktsvc.aots.att.com/ticket">true</ns7:GetPVCDetailsInfo>
                <ns8:GetLocationDetailsInfo xmlns:ns8="http://tktsvc.aots.att.com/ticket">true</ns8:GetLocationDetailsInfo>
                <ns9:GetEventTotalDowntimeInfo xmlns:ns9="http://tktsvc.aots.att.com/ticket">true</ns9:GetEventTotalDowntimeInfo>
                <ns10:GetBvoipLocationInfo xmlns:ns10="http://tktsvc.aots.att.com/ticket">true</ns10:GetBvoipLocationInfo>
                <ns11:GetMTTRInfo xmlns:ns11="http://tktsvc.aots.att.com/ticket">true</ns11:GetMTTRInfo>
                <ns12:GetMTTRChangeHistoryInfo xmlns:ns12="http://tktsvc.aots.att.com/ticket">true</ns12:GetMTTRChangeHistoryInfo>
                <ns13:GetTestResultsInfo xmlns:ns13="http://tktsvc.aots.att.com/ticket">true</ns13:GetTestResultsInfo>
                <ns14:GetAccountContractDetailsInfo xmlns:ns14="http://tktsvc.aots.att.com/ticket">true</ns14:GetAccountContractDetailsInfo>
                <ns15:GetUniqueLogID xmlns:ns15="http://tktsvc.aots.att.com/ticket">true</ns15:GetUniqueLogID>
                <ns16:GetIVRNotificationEventsInfo xmlns:ns16="http://tktsvc.aots.att.com/ticket">true</ns16:GetIVRNotificationEventsInfo>
                <ns17:GetLCONDetailsInfo xmlns:ns17="http://tktsvc.aots.att.com/ticket">true</ns17:GetLCONDetailsInfo>
                <ns18:GetRelatedTicketInfo xmlns:ns18="http://tktsvc.aots.att.com/ticket">true</ns18:GetRelatedTicketInfo>
            </ns0:getTicketInput>
        </ns0:getTicketRequest>
    </soap-env:Body>
</soap-env:Envelope>